soap/test/sendMessages.3.xml


<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://xml.m4u.com.au/2009">
 <env:Body>
  <ns:sendMessages>
   <ns:authentication>
    <ns:userId>my-user-id</ns:userId>
    <ns:password>my-password</ns:password>
   </ns:authentication>
   <ns:requestBody>
    <ns:messages>
     <ns:message format="SMS" sequenceNumber="0">
      <ns:recipients>
       <ns:recipient uid="0">61412345678</ns:recipient>
      </ns:recipients>
      <ns:scheduled>2014-05-14T12:30:00</ns:scheduled>
      <ns:content>Scheduled test message.</ns:content>
     </ns:message>
    </ns:messages>
   </ns:requestBody>
  </ns:sendMessages>
 </env:Body>
</env:Envelope>

